Revit 2027 API
RebarHostData.GetFabricAreasInHost Method
 Returns all FabricArea elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricArea> GetFabricAreasInHost()
Public Function GetFabricAreasInHost As IList(Of FabricArea)
public:
IList<FabricArea^>^ GetFabricAreasInHost()
member GetFabricAreasInHost : unit -> IList<FabricArea>
Return Value
IList<FabricArea>
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace